{ "tabs": [
	{"position": 1,
	"title": "Upload Your Photos",
	"panels": [
		{"type": "fileSelect",
		"desc": "Select your pictures:",
		"hint": "Browse for the folder that contains the images that you wish to upload. This folder can have sub-folders within it.",
		"returnValue": "filepath"
		},
		
		{"type": "multiPanel",
		"subPanels": [
			{"type": "date",
			"desc": "For this deployment, on what date was the camera placed in the field?   ",
			"hint": "Enter the the start and end dates of deployment for the camera. Click the calender icon to select date.",
			"returnValue": "Start Date"
			},
		
			{"type": "date",
			"desc": "For this deployment, on what date was the camera removed from the field?",
			"returnValue": "End Date"
			}
		]},

		{"type": "dropdown",
		"desc": "Please select the group or organization you are working with on this project, if any:",
		"hint": "Some people engage with North Country Wild through collaborations with school groups or by checking a game camera out from Nature Up North or local library. If you are affiliated with a group, please enter it here.",
		"values": [
			"Unaffiliated"
		],
		"returnValue": "Affiliation"
		}
	]},
		
	{"position": 2,
	"title": "Camera Location",
	"panels": [
		{"type": "text",
		"desc": "Please enter latitude and longitude:"
		},
		
		{"type": "multiPanel",
		"subPanels": [
			{"type": "slider",
			"desc": "Latitude:",
			"hint": "If you do not know the longitude and latitude of the camera location, you can search for them here: https://mynasadata.larc.nasa.gov/latitudelongitude-finder/",
			"returnValue": "Latitude"
			},
			
			{"type": "slider",
			"desc": "Longitude:",
			"hint": "If you do not know the longitude and latitude of the camera location, you can search for them here: https://mynasadata.larc.nasa.gov/latitudelongitude-finder/",
			"returnValue": "Longitude"
			}
		]}
	]},
	
	{"position": 3,
	"title": "Habitat and Urbanization",
	"panels": [
		{"type": "multiChoiceList",
		"desc": "<html>Which of the following terms would characterize the habitat in the location where the camera was placed?<br/>(check all that apply)</html>",
		"hint": "Hardwood Forest: Dominated by mainly hardwood species including for example maple, beech, cherry, and birch.\n\nEvergreen Forest: Dominated by mainly evergreen species including for example white pine, red spruce, balsam fir, hemlock, and possibly plantation pines such as Scots pine.\n\nMixed Forest: Hardwood and Evergreen trees are present in a balanced mix.\n\nPlantation Forest: Trees (usually Pines) are evenly spaced in an organized fashion throuhgout the forest and there are mainly one single species making up the forest leaf-layer (canpoy).\n\nNatural Field or Meadow: Area dominated by grasses and plants such as goldenrod and milkweed; possibly interspersed with a few young trees such as pine or cedar. Not mowed.\n\nPublic Park/School Grounds/Lawn: Primarily open area with some trees interspersed; grass is the predominant vegetation, perhaps supplemented with e.g. flower beds. Grass is regularly maintained by mowing.\n\nWetland edge: If the camera was placed within 15 feet of a pond or wetland, please check this box.\n\nEdge between two habitats: If the camera is located within about 25 feet of more than one of the habitats listed above, please select this choice.",
		"values": [
			"Hardword Forest",
			"Mixed Forest",
			"Evergreen Forest",
			"Plantation Forest",
			"Natural Field or Meadow",
			"Agricultural Field",
			"Public Park/School Grounds/Lawn",
			"Wetland Edge",
			"Edge between two habitats"
		],
		"returnValue": "Habitats"
		},
		
		{"type": "singleChoiceList",
		"desc": "How urbanized is the location where the camera was placed? (Please check one)",
		"hint": "Rural: Camera was placed on public or private land in a rural location away from much human influence.\n\n Suburan/moderately urban: Camera was placed near the edge of a town or village where there are more homes and other development than in rural places.\n\nPrimarily urban: Camera was placed inside of a town or village in a location where automobile traffic is prevalent as is the amount of developed space (storefront, parking areas, etc.).",
		"values": [
			"Rural",
			"Suburban/Moderately Urban",
			"Primarily Urban"
		],
		"returnValue": "Urbanization"
		}
	]},
	
	{"position": 4,
	"title": "Any Comments?",
	"panels": [
		{"type": "form",
		"desc": "Is there anything else you'd like to share about this batch of pictures?",
		"returnValue": "Comments"
		}
	]}
]}
